<template>
    <div class="agreement-box">
        <van-nav-bar title="用户协议" left-arrow @click-left="$router.back()" />
        <div class="agreement-wrapper">
            <p>
                尊敬的用户您好，在同意本协议前，请您认真阅读并充分知悉、理解
                M直播平台的各项规则及要求，以及国家关于该类互联网信息服务的法律法规等。如果您对本协议的任何条款表示异议，您可以选择不使用；使用则意味着您将同意遵守本协议下全部规定，以及我们后续对本协议随时所作的任何修改，并完全服从于我们的统一管理。本协议已对与您的权益有或可能具有重大关系的条款，及对
                M直播平台具有或可能具有免责或限制责任的条款用粗体字予以标注，请您注意。如您需要
                M直播平台对相关条款内容予以说明，请您联系我们。
            </p>
            <h4>第一章&nbsp;总则</h4>
            <p>
                第1条&nbsp; M直播平台是
                M直播团队(以下统称“本团队”)向用户提供的一种更方便的进行视频直播、观看视频直播服务并与注册用户进行互动的视频社交平台。
                M直播平台将为用户提供虚拟礼物、技术支持、流量入口等进行视频社交所需的服务。
            </p>
            <p>第2条&nbsp; M直播平台所有权、经营权、管理权均属本团队。</p>
            <p>第3条&nbsp;本协议最终解释权归属本团队。</p>
            <h4>第二章&nbsp; M直播平台账号</h4>
            <p>
                第4条&nbsp;您作为用户注册成功后，
                M直播平台将为您提供一个账号（下称“ M直播账号”）。您在申请使用
                M直播平台服务时，应当按照 M直播平台的要求向
                M直播平台提供真实、准确的个人资料，以完成实名认证；如个人资料有任何变动，您须及时在
                M直播平台上予以更新。您使用 M直播平台产品、服务或者浏览网页，即为同意
                M直播平台收集、保有并与合作伙伴分享您的相关个人信息。
            </p>
            <p>
                第5条&nbsp; M直播账号性质上是您接受
                M直播平台向您提供服务的凭证；同时是您持有、使用"金币"等相关虚拟财产及进行"金币"兑换的身份凭证。您若需要
                M直播平台提供增值服务，
                M直播账号同时也是您支付费用、接受增值服务的凭证。
            </p>
            <p>
                第6条&nbsp;
                M直播账号仅限于您本人使用，禁止赠与、借用、租用、转让或售卖。如果
                M直播平台发现使用者并非 M直播账号初始注册人， M直播平台有权不经通知收回
                M直播账号而无需向账号使用人承担法律责任，由此带来的包括并不限于通讯中断、资料和虚拟财产清空等损失由初始注册人自行承担。
            </p>
            <p>
                第7条&nbsp;您可自主设定
                M直播账号名称、头像、简介等注册信息，不得含有违法和不良信息；如存在该等情况，
                M直播平台有权采取通知限期改正、暂停使用、注销登记等措施。
            </p>
            <p>
                第8条&nbsp;您同意
                M直播平台无偿使用您的名称（包括但不限于真实姓名、笔名、网名及任何代表您身份的文字符号）、肖像（包括但不限于真人肖像及卡通肖像）以及其他相关个人信息进行
                M直播平台的各类宣传、向合作伙伴分享、与合作伙伴共同向用户展示用户可能感兴趣的内容等行动。
            </p>
            <h4>第三章&nbsp;用户说明</h4>
            <p>
                第9条&nbsp;凡是在 M直播平台下载、浏览和发布内容的用户均为
                M直播平台用户。您可在
                M直播平台进行视频直播（此时您称为“主播”）、观看视频直播服务并与其他注册用户互动，赠与或接受其他注册用户或
                M直播平台赠与的虚拟礼物，赠与的虚拟礼物一经送出即不可撤销。但您与
                M直播平台不构成任何法律层面的雇佣、劳动或劳务或任何与此相似的关系。
                M直播平台对主播建立信用等级管理体系，提供与信用等级挂钩的管理和服务。
            </p>
            <p>
                第10条&nbsp;您必须年满18周岁。&nbsp;本协议内容与您所属国家或地区的相关法律法规法令等不相冲突。不具备前述条件的，您应立即终止注册或停止使用。
            </p>
            <p>
                第11条&nbsp;您自行承担在
                M直播平台进行视频直播和观看视频直播所需要的网络、设备，并保证直播图像和语音质量的清晰、稳定。
            </p>
            <p>
                第12条&nbsp;您的个人信息受到保护，除相关国家机关或机构或司法机关依法查询或调查，或您个人自行设置个人信息公开以外，不接受任何个人或单位的查询。
            </p>
            <p>
                第13条&nbsp;在不违反适用法律法规的前提下，您享有言论自由的权利。
            </p>
            <p>
                第14条&nbsp;您的言行不得违反《计算机信息网络国际联网安全保护管理办法》、《互联网信息服务管理办法》、《互联网电子公告服务管理规定》、《维护互联网安全的决定》、《互联网新闻信息服务管理规定》等相关法律规定，不得在
                M直播平台上发布、传播或以其它方式传送含有下列内容之一的直播内容或信息：
            </p>
            <p></p>
            <p>（&nbsp;1&nbsp;）反对宪法所确定的基本原则的；</p>
            <p>
                （&nbsp;2&nbsp;）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
            </p>
            <p>（&nbsp;3&nbsp;）损害国家荣誉和利益的；</p>
            <p>（&nbsp;4&nbsp;）煽动民族仇恨、民族歧视，破坏民族团结的；</p>
            <p>（&nbsp;5&nbsp;）破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
            <p>（&nbsp;6&nbsp;）散布谣言，扰乱社会秩序，破坏社会稳定的</p>
            <p>
                （&nbsp;7&nbsp;）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
            </p>
            <p>（&nbsp;8&nbsp;）侮辱或者诽谤他人，侵害他人合法权益的；</p>
            <p>
                （&nbsp;9&nbsp;）未获他人允许，偷拍、偷录他人，侵害他人合法权利的；
            </p>
            <p>
                （&nbsp;10&nbsp;）煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；
            </p>
            <p>（&nbsp;11&nbsp;）以非法民间组织名义活动的；</p>
            <p>
                （&nbsp;12&nbsp;）含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、侮辱、诽谤、中伤、粗俗、猥亵、或其它道德上令人反感的内容；
            </p>
            <p>（&nbsp;13&nbsp;）侵犯他人知识产权的内容；</p>
            <p>
                （&nbsp;14&nbsp;）含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的；
            </p>
            <p>第15条&nbsp;您不得在 M直播平台内直接或间接发布任何形式的广告。</p>
            <p>
                第16条&nbsp;您不得采用任何形式进行网络赌博活动，包括以"金币"、“虚拟礼物”等虚拟财产为标的或赌资进行线上赌博，或者通过直播平台组织线下赌博活动。
                M直播将严密监控此类行为，并有权对多个定向账户中异常的、数额较大的虚拟资产流转进行调查，，并有权配合主管机关的调查提交您的身份资料、有关账户的交易记录等信息。
            </p>
            <p>
                第17条&nbsp;您不得利用本平台进行任何形式的洗钱活动。
                M直播将严密监控此类行为，并有权对多个定向账户中异常的、数额较大的虚拟资产流转进行调查，并有权配合主管机关的调查提交您的身份资料、有关账户的交易记录等信息。
            </p>
            <p>
                第18条&nbsp;您通过苹果应用商店为
                M直播平台充值的次数每天不能超过20次，如果超过20次则
                M直播平台将冻结您的
                M直播账户。如果您违规使用非本人苹果手机应用商店代冲值，或者通过其它非
                M直播平台认可的渠道非法购买或充值，则 M直播平台有权冻结该
                M直播账户，并进行相应惩罚，严重者可以进行封号处理。
            </p>
            <p>
                第19条&nbsp;您应承担一切因您个人的行为而直接或间接导致的民事、行政或刑事法律责任，因您违反法律法规或违反本协议的行为给本团队造成损失的，您应负责赔偿。
            </p>
            <p>
                第20条&nbsp;禁止任何使用非法软件进行刷内容、违规发布内容的行为。
            </p>
            <p>
                第21条&nbsp;您发现
                M直播平台上有内容涉嫌违法违规、侮辱或者诽谤他人、侵害他人合法权益、违反本协议或
                M直播平台任何运营和管理规则的，有权进行直接举报。
            </p>
            <p>
                第22条&nbsp;未经 M直播平台书面同意，您不得在
                M直播平台上以任何方式提及第三方竞争平台的相关信息，不得引导用户进入其他第三方竞争平台或为其提供任何信息或便利。
            </p>
            <h4>第四章&nbsp;权利声明</h4>
            <p>
                第23条&nbsp;本团队有权制定平台运营规则及注册用户管理规则及相关格式条款，并有权根据运营等情况对相应规则及/或条款进行变更、调整、中止或终止。本团队拥有对
                M直播平台上的内容进行监控并对违反本协议的用户进行处理的权利。
            </p>
            <p>
                第24条&nbsp;您在
                M直播平台发布、直播的内容仅为您个人行为，与本团队无关。对于您的直播内容、言论的真实性、合法性等引发的全部责任，由您自行承担，本团队不承担任何责任。因您发布、直播的内容、言论而引起的法律纠纷，由您自行解决，与本团队无关。如
                M直播平台因此遭受任何损失， M直播平台有权向您追偿，您同意向
                M直播平台承担相应的损害赔偿责任，您承担赔偿责任的方式包括但不限于根据
                M直播平台的书面通知等向其支付赔偿金、以累计的虚拟资产（如"金币"）抵偿相关损失等。
            </p>
            <p>
                第25条&nbsp;用户之间因使用
                M直播平台而产生或可能产生的任何纠纷和/或损失，由用户自行解决并承担相应的责任，与本团队无关。
            </p>
            <p>
                第26条&nbsp;
                M直播平台未来可能提供部分收费的网络服务，对于此类服务，
                M直播平台会在您使用前给与您明确的提示，只有您根据提示确认愿意支付相关费用，您才能使用该等收费网路服务；如果您拒绝支付相关费用，则
                M直播平台有权不向您提供该等收费网络服务。
            </p>
            <p>
                第27条&nbsp;
                M直播平台系统因下列状况无法正常运作，使您无法使用各项服务或任何信息、虚拟财产丢失时，本团队不承担损害赔偿责任，该状况包括但不限于：
            </p>
            <p>（1） M直播平台系统停机维护、升级、调整期间；</p>
            <p>（2）电信通讯或设备出现故障不能进行数据传输的；</p>
            <p>
                （3）因台风、地震、海啸、洪水、停电、战争、恐怖袭击、政府管制等不可抗力之因素，造成
                M直播平台系统障碍不能执行业务的；
            </p>
            <p>
                （4）由于黑客攻击、电信部门技术调整或故障、网站升级、相关第三方的问题等原因而造成的服务中断或者延迟。
            </p>
            <h4>第五章&nbsp;处罚规则</h4>
            <p>
                第28条&nbsp;凡您发布、直播的内容或信息出现以下情况之一，本团队管理人员有权不提前通知您直接采取停播、删除内容。情节严重者，本团队管理人员有权采取关闭部分或全部权限、暂时封禁
                M直播账号或永久封禁 M直播账号、列入黑名单、配合主管部门调查等措施。
            </p>
            <p>1.发布、传播含有本协议第14条禁止发布、传播的内容的；</p>
            <p>2.发表无意义的灌水内容的；</p>
            <p>3.同一内容多次出现的；</p>
            <p>4.违反本协议第15条的规定，发布广告的；</p>
            <p>5.违反本协议第16条的规定，从事任何形式赌博行为的</p>
            <p>6.违反本协议第17条的规定，从事任何洗钱行为的；</p>
            <p>7.内容包含有严重影响您或其他用户浏览的内容或格式的；</p>
            <p>8.从事非法商业活动的；</p>
            <p>9.假冒管理人员或破坏管理人员形象的；</p>
            <p>
                10.违反本协议第20条规定，使用非法软件进行刷内容、违规发布内容的行为；
            </p>
            <p>11.使用不雅或不恰当昵称的；</p>
            <p>12.发布侵犯他人知识产权的内容等且被举报的；</p>
            <p>13.其他本团队认为不恰当的情况。</p>
            <p>
                第29条&nbsp;如用户在使用
                M直播平台时出现本协议第28条之任一情形而导致
                M直播账号被暂时或永久封禁的，在此期间您
                M直播账户上的剩余“金币”将被暂时冻结或全部扣除，不可继续用于购买
                M直播平台上的虚拟产品或服务，同时不予返还您购买以及”金币”时的现金价值。对于您
                M直播账户上存有之剩余”金币”，
                M直播平台有权依据系统监控记录信息直接扣除您基于本协议第28条项下的行为而取得的全部虚拟财产所得；如果您的行为给
                M直播平台造成损失， M直播平台有权在 M直播平台的损失范围内扣减您
                M直播账户内按照
                M直播平台公布的现金兑换规则计算的与损失等额的"金币"；扣除后剩余的"金币"，
                M直播平台将与您单独进行结算。
            </p>
            <p>
                第30条&nbsp; M直播平台有权对您在
                M直播平台上所发布或直播的内容、发表的言论等提出改进建议和意见，您在收到
                M直播平台的建议或意见后3个工作日内进行相应的整改，否则
                M直播平台有权采取上述第28条、第29条项下相应的惩罚措施。
            </p>
            <p>
                第31条&nbsp;为了能够给广大用户提供一个优质的交流平台，同时使得
                M直播平台能够良性、健康的发展，
                M直播平台将对涉及反动、色情和发布不良内容的用户、采用任何形式从事线上、线下赌博活动的用户或利用本平台进行洗钱的用户，进行严厉处理。一经发现此类行为，将给予永久封禁、列入黑名单并清空所有内容以及直接扣除
                M直播账号上存有的全部虚拟财产（如"金币"）的处罚。若 M直播平台认为用户
                M直播账号。
            </p>
        </div>
    </div>
</template>

<script>
export default {
    name: 'index',
    methods: {
        goBack() {
            this.$router.go(-1);
        },
    },
};
</script>

<style scoped lang="scss">
.agreement-box {
    width: 100%;

    .agreement-wrapper {
        padding: 16px;
        h4 {
            margin: 14px 0;
            font-weight: bold;
            font-size: 14px;
        }
        p {
            font-size: 14px;
            line-height: 18px;
        }
    }
}
</style>
