<template>
    <div class="agreement-wrapper">
        <div class="fx align-items">
            <div style="margin-right: 35%" @click="goBack">
                <img src="../../assets/image/back.png" width="20px" />
            </div>
            <div class="fs-20 fw-700">隐私协议</div>
        </div>
        <section class="article mt-10">
            <p>
                xx直播重视个人信息保护。您在使用xx直播服务时，xx直播可能会收集和使用您的个人信息。xx直播通过本《用户隐私协议》(以下或简称
                “本协议”)向您说明xx直播如何收集、使用、储存、分享、保护和删除这些信息，以及xx直播为您提供的访问、更新、控制和保护这些信息的方式等。
            </p>
            <p>
                请您务必仔细阅读本协议，尤其是关于您的个人敏感信息、您的权利限制、xx直播责任免除等相关条款，上述条款xx直播将通过加粗或下划线的方式向您作出提示。您勾选同意本协议或在本协议发布后仍继续使用xx直播提供的服务，将视为您已阅读并同意本协议全部内容。若您不同意本协议的全部或部分条款，请您立即停止使用xx直播提供的服务。
            </p>
            <h4>一、xx直播如何收集和使用您的信息</h4>
            <p>
                个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。xx直播仅会出于本协议所述的以下目的，收集和使用您的个人信息：
            </p>
            <p>(一)注册成为用户</p>
            <p>
                1、为完成账号注册，您需提供以下信息：帐号、密码、昵称、头像和手机号码(用于实名认证)，除提供上述信息，您需明确表示同意《用户服务协议》和本协议。您可以使用xx直播提供的观看直播、发布弹幕信息、购买有料产品等服务。如果您选择不提供为实现xx直播基础业务功能或某类功能所必备的信息，可能导致我们无法为您提供服务
            </p>
            <p>
                2、在您进行xx直播帐号注册时，我们会需要您提供手机号码进行实名认证，如您拒绝提供手机号码进行实名验证，将导致注册不成功，因此无法使用发布信息的相关功能。但是您可以退出注册页面后以“游客”身份观看直播。
            </p>
            <p>(二)通过第三方账号(微信、微博、QQ)登录xx直播平台</p>
            <p>
                1、您使用第三方帐号(微信、微博、QQ)登录xx直播时，可选择授权xx直播读取并获得您在该第三方平台上登记、公布、记录的公开信息(包括昵称、头像)。xx直播需要您授权从第三方获取上述信息是为了记住您作为xx直播用户的登录身份，以向您提供更优质的产品和服务。我们仅会在您授权同意的范围内收集并使用您的个人信息。
            </p>
            <p>(三)附加功能信息收集和使用</p>
            <p>
                1、基于相机/相册的附加功能。您可在开启相机/摄像头权限后使用该功能，可用于主播开播、更换用户个人头像、更换直播间封面图。
            </p>
            <p>
                2、基于麦克风的语音技术的附加功能。您可在开启麦克风权限后使用麦克风实现主播开播功能。请您知晓，即使您已同意开启麦克风权限，我们也仅会在您主动开播时通过麦克风获取语音信息。
            </p>
            <p>
                3、定位功能。当您开启设备定位功能并使用xx直播基于位置提供的相关服务时，我们会通过IP地址、GPS、WLAN或基站途径获取您的地理位置信息，然后用于判断直播内容是否适合用户所在地区播放。
            </p>
            <p>4、通知功能。用于接收主播开播提醒、活动消息等通知。</p>
            <p>
                5、主播身份认证服务。当您申请成为xx直播平台的主播时，xx直播将对您个人信息进行认证、核实。因此，当您申请成为xx直播平台主播，我们需要收集您的姓名、性别、年龄、国籍、IP地址、身份证号、电子邮箱、手机号码。如不提供，您将无法成为xx直播平台主播进行开播。
            </p>
            <p>
                6、客户服务。当您向xx直播提起投诉、申诉或进行咨询时，为了方便与您联系或帮助您解决问题，我们可能需要您提供姓名、手机号码、电子邮件。如您拒绝提供上述信息，我们可能无法及时向您反馈投诉、申诉或咨询结果。
            </p>
            <p>
                7、安全保障。为提高您使用我们及我们关联公司、合作方提供服务的安全性，保护您或其他用户的人身财产安全免受侵害，更好的预防钓鱼网站、欺诈、网络漏洞、计算机病毒、网络攻击、网络入侵等安全风险，我们可能使用或整合您的帐号信息、交易信息、设备信息、服务日志信息以及我们关联公司、合作方已取得您授权或依据法律共享的信息，来综合判断您帐号交易风险、进行身份验证、检测及防范安全事件，并采取必要的记录、审计、分析、处置措施。
            </p>
            <p>
                8、定向推送。我们会基于收集的信息，对您的偏好、习惯、位置作特征分析或用户画像，以便为您提供更适合的定制化服务，例如向您展示或推荐相关程度更高的搜索结果、信息流或者广告/推广信息结果。为此，我们需要收集您的设备信息、浏览器型号、日志信息、浏览记录。
            </p>
            <p>
                若您拒绝提供相关信息，可能无法注册成为xx直播的用户、无法使用xx直播提供的某些服务或导致xx直播提供的某项服务无法达到预期的效果。
            </p>
            <p>
                关于个人敏感信息的特别提示：个人敏感信息是指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。xx直播收集的个人敏感信息根据您使用的服务类型可能包括身份证件号码、手机号码、位置信息、交易信息、电子邮件等。xx直播已通过本协议向您明示需要提供上述信息的功能和服务，请您认真考虑后决定是否予以授权。
            </p>
            <p>
                关于共享信息的提示：xx直播提供的服务具有一定的社交媒体属性，您在xx直播自行上传或发布的公开信息，如昵称、头像、访问记录、留言、弹幕、位置信息、日志信息等，可能会长期的保存在相关网络公共领域或被其他用户或不受xx直播控制的非关联第三方独立地缓存、复制或储存，或由其他用户或该等第三方在公众领域保存。请您谨慎选择上传或发布的内容或及时删除相关共享信息或通过隐私设定控制共享信息的访问人群，或通过xx直播提供的其他操作方式来解决此类问题。
            </p>
        </section>
        <section class="article">
            <h4>二、xx直播如何使用cookie和同类技术</h4>
            <p>
                为确保网站正常运转，我们会在您的计算机或移动设备上存储名为
                Cookie 的小数据文件。Cookie
                通常包含标识符、站点名称以及一些号码和字符。Cookie主要的功能是便于您使用网站产品和服务，以及帮助网站统计独立访客数量等。运用Cookie技术，我们能够为您提供更加周到的个性化服务，并允许您设定您特定的服务选项。
                当您使用xx直播的产品和服务时，会向您的设备发送Cookie。当您与我们提供给合作伙伴的服务(例如广告和/或推广服务，以及可能显示在其他网站上的由xx直播提供的服务功能)进行交互时，我们允许Cookie(或者其他匿名标识符)发送给xx直播的服务器。
                我们不会将 Cookie
                用于本隐私政策所述目的之外的任何用途。您可根据自己的偏好管理或删除
                Cookie。有关详情，请参见
                AboutCookies.org。您可以清除计算机上保存的所有
                Cookie，大部分网络浏览器都设有阻止 Cookie
                的功能。但如果您这么做，则需要在每一次访问我们的网站时亲自更改用户设置，但您可能因为该等修改，无法登录或使用依赖于Cookie的xx直播提供的服务或功能。
                您可以通过更改您的浏览器设置限制xx直播公司对Cookie的使用。以Chrome浏览器为例，您可以在Chrome浏览器右上方的下拉菜单的“浏览器设置”中，通过“隐私设置——清除浏览数据”，选择清除您的Cookie。
            </p>
        </section>
        <section class="article">
            <h4>三、xx直播如何分享您的信息</h4>
            <p>
                xx直播不会与xx直播关联公司以及合作方以外的任何公司、组织和个人分享您的个人信息，但以下情况除外：
            </p>

            <p>
                (一)在获取明确同意的情况下共享：获得您的明确同意后，xx直播会与其他方共享您的个人信息。
            </p>
            <p>
                (二)xx直播可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的个人信息。
            </p>
            <p>
                (三)与xx直播的关联公司共享：您的个人信息可能会与xx直播的关联公司(基于合伙、股权、投资或合作运营等法律关系)共享。我们只会共享必要的个人信息，且受本隐私协议中所声明目的的约束。关联公司如要改变个人信息的使用用途和范围，将再次征求您的授权同意。
            </p>
            <p>
                (四)与第三方服务提供商共享：仅为实现本隐私协议所声明的目的和用途，我们的某些服务将由授权合作方提供。我们可能会与合作方共享您的某些个人信
                息，以提供更好的客户服务和用户体验。例如：该第三方为代表xx直播发出电子邮件或推送通知的通讯服务提供商；为xx直播提供位置数据的地图服务供应商；为xx直播提供网络安全监控和数据分析的服务商等。
            </p>
            <p>
                (五)与广告、分析服务类的授权合作方共享。如xx直播会向广告合作方提供有关其广告覆盖面和有效性的信息，而不会提供您的个人身份信息，或者xx直播将这些信息进行汇总，以便它不会识别您个人。除非得到您的同意，否则我们不会将您的个人身份信息(指可以识别您身份信息、姓名或电子邮箱，通过这些信息可以联系到您或识别您的身份)与提供广告、分析服务的合作方的分享。
            </p>
            <p>
                xx直播对您的个人信息的分享遵循必要性、合理性、可控性原则，采取严格的安全措施和保密措施，确保作为信息接收方的任何关联公司和第三方服务提供商在使用您的个人信息时务必遵守本协议的信息保护要求或采取同等的安全和保密措施。
            </p>
        </section>
        <section class="article">
            <h4>四、xx直播如何转让您的信息</h4>
            <p>
                xx直播不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
            </p>
            <p>
                (一)在获取明确同意的情况下转让：获得您的明确同意后，xx直播会向其他方转让您的个人信息；
            </p>
            <p>
                (二)在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会在要求新的个人信息接收方(持有您个人信息的公司、组织)继续受此隐私协议的约束，否则，xx直播将要求该公司、组织重新向您征求授权同意。
            </p>
        </section>
        <section class="article">
            <h4>
                五、xx直播如何披露您的信息
                xx直播仅会在以下情况下，公开披露您的个人信息：
            </h4>
            <p>(一)获得您明确同意后。</p>
            <p>
                (二)基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下。
            </p>
            <p>(三)与国家安全、国防安全直接相关的。</p>
            <p>(四)与公共安全、公共卫生、重大公共利益直接相关的。</p>
            <p>(五)与犯罪侦查、起诉、审判和判决执行等直接相关的；</p>
        </section>
        <section class="article">
            <h4>六、xx直播如何储存和保护您的信息</h4>
            <p>
                (一)储存期限：xx直播仅在本《用户隐私协议》所述目的所必需期间和法律法规要求的时限内储存您的个人信息。
            </p>
            <p>
                (二)储存地域范围：xx直播依据本协议在中华人民共和国境内收集和产生的个人信息，将存储在中华人民共和国境内。
            </p>
            <p>
                (三)保护措施：xx直播已使用符合业界标准的安全防护措施来保护您的信息，以防止您的个人信息未经授权被访问、丢失、损坏、修改、不当使用。xx直播会采取一切合理可行的措施(如SSL
                加密保护)保护您的个人信息。xx直播会使用受信赖的保护机制防止数据遭到恶意攻击；同时，xx直播会部署访问控制机制，确保只有授权人员才可访问个人信息；xx直播也会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识；xx直播将定期开展安全风险、个人信息安全影响评估，以努力确保您的信息安全。
            </p>
            <p>
                请您注意：互联网并非绝对安全的环境，同时，鉴于互联网网络风险具有一定的不可预测性和技术发展的局限性，请您设置相对复杂的密码，并尽量避免使用电子邮件、即时通讯进行个人信息的发送。
            </p>

            <p>
                若发生个人信息安全事件后，xx直播将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。xx直播将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，xx直播还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
            </p>
        </section>
        <section class="article">
            <h4>七、您如何控制您的个人信息</h4>
            <p>
                除法律法规另有规定外，xx直播保障您对个人信息可行使以下权利，在您行使以下权利时，xx直播可能会要求您进行身份验证，以保障您的账户安全：
            </p>

            <p>
                (一)访问您的个人信息：您有权自行访问您的个人信息(包括用户名、昵称、手机号、虚拟货币、关注列表、支付信息)，如果您无法正常访问上述个人信息，您可以随时与xx直播联系。xx直播将在30天内回复您的访问请求。
            </p>
            <p>
                (二)更正您的个人信息：当您出于自身个人原因或或发现xx直播处理您的个人信息存在错误时，您有权通过个人信息中的“更换”或“修改”提示进行操作或向xx直播提出更正要求。
            </p>

            <p>
                (三)删除您的个人信息：存在以下情形之一，您可以向xx直播提出删除个人信息的请求：1、如果xx直播处理个人信息的行为违反法律法规；
                2、如果xx直播收集、使用您的个人信息，却未征得您的同意；
                3、如果xx直播处理个人信息的行为违反了与您的约定；
                4、如果您不再使用xx直播的产品或服务，或您注销了账号；
                5、如果xx直播不再为您提供产品或服务。当您从xx直播的服务中删除信息后，xx直播可能不会立即备份系统中删除相应的信息，但会在备份更新时删除这些信息。
            </p>
            <p>
                (四)改变您授权同意的范围：每个业务功能需要一些基本的个人信息才能得以完成(见本协议“xx直播如何收集和使用您的信息”)。对于额外收集的个人信息的收集和使用，您可以随时给予或收回您的授权同意。但您收回同意的决定，不会影响此前基于您的授权已经开展的个人信息处理。
            </p>
            <p>
                (五)个人信息主体注销账户：您可随时申请注销此前注册的账户，在您完成注销账户之后，我们将停止为您提供产品或服务，并依据您的要求，删除您的个人信息，法律法规另有规定的除外。
            </p>
            <p>
                对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段(例如，需要开发新系统或从根本上改变现行惯例)、给他人合法权益带来风险或者非常不切实际(例如，涉及备份磁带上存放的信
                息)的请求，我们可能会予以拒绝。
            </p>
            <p>
                在以下情形中，按照法律法规要求，xx直播将无法响应您的请求：
                1、与国家安全、国防安全直接相关的；
                2、与公共安全、公共卫生、重大公共利益直接相关的；
                3、与犯罪侦查、起诉、审判和判决执行等直接相关的；
                4、有充分证据表明您存在主观恶意或滥用权利的；
                5、响应您的请求将导致您或其他个人、组织的合法权益受到严重损
                害的。 6、涉及商业秘密的。
            </p>
        </section>
        <section class="article">
            <h4>八、xx直播如何处理儿童的个人信息</h4>
            <p>
                xx直播的产品、网站和服务主要面向成人。未经父母或监护人的书面同意，儿童不得创建自己的用户账户。尽管法律和各地习俗对儿童的定义不同，但xx直播将不满
                14
                周岁的任何人均视为儿童。如果xx直播发现自己在未事先获得可证实的父母同意的情况下收集了儿童的个人信息，则会设法尽快删除相关数据。
            </p>
        </section>
        <section class="article">
            <h4>九、本协议的适用范围</h4>
            <p>
                除另有约定外，您使用xx直播所有的服务均适用本《用户隐私协议》。若某些特定服务所涉及的信息收集、使用、分享、披露等在本协议中没有进行约定或与本协议存在不一致之处，xx直播将制定专门的用户隐私条款，并获取您的授权同意。请您注意，通过xx直播的服务而接入的第三方服务（包括任何第三方网站）收集的信息、通过在xx直播服务中提供广告服务的第三方所收集的信息，可能会适用该第三方的隐私政策或受其约束。
            </p>
        </section>
        <section class="article">
            <h4>十、本协议的生效及更新</h4>
            <p>本协议自xx直播发布之日起即生效。</p>

            <p>
                xx直播的隐私协议可能变更。未经您明确同意，xx直播不会削减您按照本隐私协议所应享有的权利。xx直播会在本页面上发布对本协议所做的任何变更。对于重大变更，xx直播还会提供更为显著的通知或以电子邮件的形式告知隐私协议的具体变更内容，并提醒您阅读并授权。
            </p>

            <p>
                本协议所指的重大变更包括但不限于：1、xx直播的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；2、xx直播在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；3、个人信息共享、转让或公开披露的主要对象发生变化；
                4、您参与个人信息处理方面的权利及其行使方式发生重大变化；5、xx直播负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；6、个人信息安全影响评估报告表明存在高风险时。
                xx直播还会将本政策的旧版本存档，供您查阅。
            </p>
        </section>
    </div>
</template>

<script>
export default {
    name: 'index',
    methods: {
        goBack() {
            this.$router.go(-1);
        },
    },
};
</script>

<style scoped>
.agreement-wrapper {
    padding: 18px;
    position: absolute;
    top: 0px;
    bottom: 0px;
    left: 0px;
    width: 100%;
    -webkit-box-sizing: border-box;
    box-sizing: border-box;
    overflow: hidden;
    overflow-y: scroll;
}
.agreement-wrapper p {
    font-size: 14px;
    margin-bottom: 12px;
    text-align: justify;
}
</style>
